#include "Myclass91.h"

    A91::A91()
    {
        cout << " Вызвался конструктор класса А " << endl;
    }
    A91::~A91()
    {
        cout << " Вызвался деструктор класса А " << endl;
    }


    B91::B91()
    {
        cout << " Вызвался конструктор класса B " << endl;
    }
    B91::~B91()
    {
        cout << " Вызвался деструктор класса B " << endl;
    }


    C91::C91()
    {
        cout << " Вызвался конструктор класса C " << endl;
    }
    C91::~C91()
    {
        cout << " Вызвался деструктор класса C " << endl;
    }

